package chapter3;

// bubbleSort.java
// Пузырьковая сортировка
// Запуск программы: C>java BubbleSortApp
////////////////////////////////////////////////////////////////
class ArrayBub {
    private long[] a;// Ссылка на массив aПузырьковая сортировка
    private int nElems;    // Количество элементов данных

    //--------------------------------------------------------------
    public ArrayBub(int max)// Конструктор
    {
        a = new long[max];// Создание массива
        nElems = 0;// Пока нет ни одного элемента
    }

    //--------------------------------------------------------------
    public void insert(long value)// Вставка элемента в массив
    {
        a[nElems] = value;// Собственно вставка
        nElems++;// Увеличение размера
    }

    //--------------------------------------------------------------
    public void display()// Вывод содержимого массива
    {
        for (int j = 0; j < nElems; j++)// Для каждого элемента
            System.out.print(a[j] + " "); // Вывод
        System.out.println("");
    }

    //--------------------------------------------------------------
    public void bubbleSort() {
        int out, in;
        int left = 0;
        for (out = nElems - 1; out > 1; out--)// Внешний цикл (обратный)
        {
            for (in = 0; in < out; in++)// Внутренний цикл (прямой)
                if (a[in] > a[in + 1])// Порядок нарушен?
                    swap(in, in + 1);// Поменять местами
            for (int i = in - 1; i > left; i--) {
                if (a[i] < a[i - 1])// Порядок нарушен?
                    swap(i, i - 1);// Поменять местами
            }
            left += 1;
        }
    }

    //--------------------------------------------------------------
    private void swap(int one, int two) {
        long temp = a[one];
        a[one] = a[two];
        a[two] = temp;
    }
//--------------------------------------------------------------
} // Конец класса ArrayBub
////////////////////////////////////////////////////////////////